Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.FromStruct(Tekla.Structures.ModelInternal.dotBuildingHierarchyItem_t@)
Method for transforming the struct data to corresponding BuildingHierarchyItem data.
bhItem: Reference to the struct which will be used to populate the BuildingHierarchyItem's data.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.ToStruct(Tekla.Structures.ModelInternal.dotBuildingHierarchyItem_t@)
Method for transforming the BuildingHierarchyItem's data into corresponding struct.
bhItem: Reference to the struct which will be populated.